# 1) შექმენით უსასრულო while loop

# while True:
#     print("hello")

# 2) გამოიტანეთ მომხმარებლის შემოყვანილი სახელი 10-ჯერ იტერაციის მეშვეობით

name = input("შეიყვანე შენი სახელი: ")

count = 0
while count < 10:
    print(name)
    count += 1

# 3) შექმენით while loop და კომენტარად მიაწერეთ რომელია თავი და რომელი სხეული

# while True:  #თავი
#     print("Hello") #სხეული
#                    #დასასრული

# 4) მომხმარებელს შემოაყვანინეთ რიცხვი, სანამ ეს რიცხვი არ იქნება 100-ზე მეტი მაქამდე თავიდან მოთხოვთ რიცხვის შემოტანა
number = int(input("შეიყვანე რიცხვი: "))

while number <= 100:
    print("რიცხვი უნდა იყოს 100-ზე მეტი!")
    number = int(input("გთხოვ, თავიდან შეიყვანე რიცხვი: "))

print("სწორია:", number)

