# 1) შექმენი for loop- რომელიც გამოიტანს 1-100 ჩატვლით რიცხვებს და ასევე კენტია თუ ლუწი ეს რიცხვი.

for i in range(1, 101):
    if i % 2 == 0:
        print(f"{i} - ლუწია")
    else:
        print(f"{i} - კენტია")

# 2) მომხმარებელს შემოატანინეთ რიცხვი და და გამოიტანეთ ეს რიცხვი კენტია თუ ლუწი
number = int(input("გთხოვთ შემოიყვანოთ ნებისმიერი რიცხვი"))

if number % 2 == 0:
    print("რიცხვი ლუწია")
else:
    print("რიცხვი კენტია")

# 3) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ 'მეტია' თუ მეორე რიცხვი პირველზე მეტია თუ არადა დაბეჭდეთ  ''ნაკლებია"

num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# შევადაროთ რიცხვები
if num2 > num1:
    print("მეტია")
else:
    print("ნაკლებია")

# 4) მომხმარებელს შემოატანინეთ ორი რიცხვი და დაბეჭდეთ უფრო მაღალი რიცხვი 
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))


if num1 > num2:
    print("უფრო დიდი რიცხვია:", num1)
elif num2 > num1:
    print("უფრო დიდი რიცხვია:", num2)
else:
    print("ორივე რიცხვი ტოლია:", num1)