# 1) გააკეთეთ პატარა გულის ცემის სისტემა რომელიც ითვლის რა თქმა უნდა გულის ცემას  თუ 180 ზე მეტია ამ შემთხვევაში მაღალია თუ 160-დან 170 მდე არის ამ შემთვევაში არის ნორმალური თუ 160-ზე ნაკლებია ამ შემთხვევაში

heart_rate = int(input("please enter your heartrate: "))

# პირობის შემოწმება
if heart_rate > 180:
    print("your heart rate is high")
elif 160 <= heart_rate <= 170:
    print("your heart rate is normal")
elif heart_rate < 160:
    print("your hear rate is low")

# 2)შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილი ასაკის მიხედვით დაადგენს, რომელი ასაკობრივი ჯგუფის წევრია ადამიანი.
# თუ ასაკი უარყოფითია — გამოიტანე: "არასწორი ასაკი"
# თუ ასაკი ნაკლებია 13-ზე — გამოიტანე: "ბავშვი"
# თუ ასაკი არის 13-დან 19-ის ჩათვლით — გამოიტანე: "თინეიჯერი"
# თუ ასაკი არის 20-დან 59-ის ჩათვლით — გამოიტანე: "ზრდასრული"
# თუ ასაკი არის 60 ან მეტი — გამოიტანე: "პენსიონერი"

age = int(input("გთხოვთ შეიყვანოთ თქვენი ასაკი"))
if age < 0:
    print("არასწორი ასაკი")
elif age <= 13:
    print("შენ ხარ ბავშვი")
elif age <= 19:
    print("შენ ხარ თინეიჯერი")
elif age <= 59:
    print("შენ ხარ ზრდასრული")
else:
    print("შენ ხარ პენსიონერი")