# 1)მომხმარებელს შემოატანინეთ 3 რიცხვი და გამოიტანეთ მაგ სამი რიცხვის ჯამი 
num1 = int(input("enter a number: "))
num2 = int(input("enter a number: "))
num3 = int(input("enter a number: "))

print(num1 + num2 + num3)

# 2)დაბეჭდეთ რიცხვები 10 - 1 მდე 
print("რიცხვები 10-1 ამდე")
for i in range(10, 0, -1):
    print(i)

# 3) დაბეჭდეთ 1-დან 100-მდე რიცხვები მხოლოდ კენტები
print("კენტი რიცხვები 1-დან 100-მდე:")
for i in range(1, 101):
    if i % 2 == 1:
        print(i)

# 4) დაბეჭდეთ ყველა რიცხვი რომელიც 3-ზე უნაშთოდ იყოფა (1-დან 100-მდე)
print("რიცხვები 1-დან 100-მდე რომლებიც 3-ზე უნაშთოდ იყოფა:")
for i in range(1, 101):
    if i % 3 == 0:
        print(i)

# 5) იპოვეთ 1-დან 100-მდე რიცხვების ჯამი
sum_100 = sum(range(1, 101))
print("1-დან 100-მდე რიცხვების ჯამი არის:", sum_100)

