<<<<<<< HEAD
# 1) შექმენით 1 ცვლადი და ჩაწერეთ თქვენი სახელი(String).

Name = "Mate Javakhia" #ჩემი სახელი

# 2) შექმენით 2 ცვლადი და ჩაწერეთ თქვენი საყვარელი ფერები(String).

Color_1 = "Black"
color_2 = "White"

# 3) შექმენით 3 ცვლადი და შეინახეთ თქვენი და თქვენი მეგობრების ასაკები(Integer).

Age = 15 #ჩემი წლოვანება
Age = 16 #ჩემი მეგობრის
Age = 15 #ჩემი მეგობრის

#4) შექმენით 4 ცლვადი და თითოეულში შეინახეთ თქვენი ოჯახის წევერების სახელები.

Mom = "Maia Lobjanidze" #დედა
Dad = "Vasil Javakhia" #მამა
Sister = "Ana Javakhia" #და
Brother = "Amo Javakhia" #ძმა

#5) შექმენით 2 ცვლადი და შეინახეთ მნიშვნელობა, გყავთ თუარა შინაური ცხოველი/ფრინველი(Boolean).

has_dog = True
has_cat = False








=======
# 1) შექმენით 1 ცვლადი და ჩაწერეთ თქვენი სახელი(String).

Name = "Mate Javakhia" #ჩემი სახელი

# 2) შექმენით 2 ცვლადი და ჩაწერეთ თქვენი საყვარელი ფერები(String).

Color_1 = "Black"
color_2 = "White"

# 3) შექმენით 3 ცვლადი და შეინახეთ თქვენი და თქვენი მეგობრების ასაკები(Integer).

Age = 15 #ჩემი წლოვანება
Age = 16 #ჩემი მეგობრის
Age = 15 #ჩემი მეგობრის

#4) შექმენით 4 ცლვადი და თითოეულში შეინახეთ თქვენი ოჯახის წევერების სახელები.

Mom = "Maia Lobjanidze" #დედა
Dad = "Vasil Javakhia" #მამა
Sister = "Ana Javakhia" #და
Brother = "Amo Javakhia" #ძმა

#5) შექმენით 2 ცვლადი და შეინახეთ მნიშვნელობა, გყავთ თუარა შინაური ცხოველი/ფრინველი(Boolean).

has_dog = True
has_cat = False








>>>>>>> cba7358c4110085990068d40fc07864cd0bdb9f5
