# 1) შემოატანინეთ მომხხმარებელს სტრინგი და გამოიტანეთ მისი პირველი ასო

str = input("შეიყვანეთ ნებისმიერი string : ")

if str :
    print("თქვენი სტრინგის პირველი ასოა:", str[0])
else:
    print("სტრინგი  არ შეყვანილა.")



#  2) შემოატანინეთ მომხმარებელს ორი სტრინგი და გამოიტანეთ მათ გაერთიანება 

str1 = input("შეიყვანეთ ნებისმიერი string : ")
str2 = input("შემოიყვანეთ მეორე String : ")

if str1 :
    print(("თქვენი სტრინგის პირველი ასოა:", str1[0] + str2[0]))
else:
    print("სტრინგი  არ შეყვანილა.")


# 3) შემოატანინეთ მომხმარებელს სტრინგი და თუ მომხმარებლის შემოტანილი სტრინგი არის 'yes', მაშინ შემოატანინეთ სახელი და გამოიტანეთ ის. ყველა ვარიანტში საბოლლოდ დაემშვიდობეთ მომხმარებლლს მესიჯი 'goodbye' - თი

str3 = input("type yes :")

if str3 == "yes":
    input("შემოიყვანეთ თქვენი სახელი და გვარი")
   
    print ("goodbye")

# 4) შემოატანინეთ მომხმარებელს ასო თუ ეს ასო არის 'A' მაშინ გამოიტანეთ რიცხვი 100, თუ ის არის 'B' - 80, თუ 'C' - 60, თუ 'D' - 40, ხოლო თუ 'F' მაშინ სიტყვა 'Failed!'


letter = input("შეიყვანეთ ასო (A, B, C, D, F): ")

if letter == 'A':
    print(100)
elif letter == 'B':
    print(80)
elif letter == 'C':
    print(60)
elif letter == 'D':
    print(40)
else:
    print("Failed!")