# დავალება 1: წნევის ანალიზი
# მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
# პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:

# თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"

# თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"

# სხვა შემთხვევაში → "წნევა ნორმალურია"

S = int(input("შემოიყვანეთ თქვენი სისტოლური წნევა: "))
D = int(input("შემოიყვანეთ თქვენი დიასტოლური წნევა: "))
if S > 140 or D > 90:
    print ("მაღალი წნევა")
elif D < 90 or D < 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")
    
# დავალება 2: წონის შეფასება ასაკის მიხედვით (უბრალოდ და ლოგიკურად)

Age = int(input("შეიყვანეთ თქვენი ასაკი: "))
KG = int(input("შეიყვანეთ თქვენი წონა: "))
if Age < 10:
    if KG < 20:
        print("წონა დაბალია")
    elif 20 <= KG <= 40:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")

elif Age >= 11 and Age < 17:
     if KG < 40:
       print("წონა დაბალია")
     elif KG > 40 and KG < 65:
       print ("წონა ნორმალურია")
     else:
         print("წონა მაღალია")

elif Age >= 18:
    if KG < 50:
       print("წონა დაბალია")
    elif KG > 50 and KG < 90:
        print("წონა ნორმალურია")
    else:
        print("წონა მაღალია")



















# # დავალება 5: ასაკი და კვება

# 0–12 → "ბევრი ვიტამინიანი საკვები"

# 13–25 → "ენერგიის მომცემი საკვები"

# 26–59 → "ბალანსირებული რაციონი"

# 60+ → "დაბალკალორიული და მსუბუქი საკვები"
# ```