# დავალება 1: წნევის ანალიზი
# მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
# პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:

# თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"

# თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"

# სხვა შემთხვევაში → "წნევა ნორმალურია"

S = int(input("შემოიყვანეთ თქვენი სისტოლური წნევა: "))
D = int(input("შემოიყვანეთ თქვენი დიასტოლური წნევა: "))
if S > 140 or D > 90:
    print ("მაღალი წნევა")
elif D < 90 or D < 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")
    