# 1) შემოაყვანინეთ მომხმარებელს n რიცხვი და დაპრინტეთ ყველა რიცხვი ნოლიდან n+1-მდე

num1 = int(input("გთხოვთ შემოიყვანოთ ნებისმიერი რიცხვი: "))
for i in range(0, num1 + 1):
    print(i)

# 2) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი.
# შემდეგ:
# თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
# თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
# სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის."

age = int(input("შეიყვანეთ თქვენი ასაკი: "))
has_student_card = input("გაქვს სტუდენტური ბარათი? (კი/არა): ")

if age < 18 or has_student_card == "კი":
    print("დანაზოგი გაქვს!")
elif age >= 60 and has_student_card != "კი":
    print("პენსიონერის ფასდაკლება გაქვს!")
else:
    print("ფასდაკლება არ გეკუთვნის.")

# 3) მომხმარებელს სთხოვე შეიყვანოს ორი რიცხვი. შემდეგ:
# თუ ორივე რიცხვი დადებითია → დაბეჭდე "ორივე დადებითია"
# თუ მხოლოდ ერთი დადებითია → "მხოლოდ ერთი დადებითი რიცხვია"
# თუ არცერთი არ არის დადებითი → "არცერთი არ არის დადებითი"

num = int(input("შემოიყვანეთ რიცხვი: "))
num1 = int(input("შემოიყვანეთ რიცხვი: "))

if num > 0 and num1 > 0:
    print("ორივე დადებითია")
elif (num > 0 and num1 <= 0) or (num <= 0 and num1 > 0):

    print("არცერთი არარარის დადებითი")

